УТ/src/Catalogs/CRM_ПравилаРасчетаКачестваЗаполненияДанных/CRM_ПравилаРасчетаКачестваЗаполненияДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ПравилаРасчетаКачестваЗаполненияДанных</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТипОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусРаботыСКлиентом</name>
    <comment>Статус работы с клиентом</comment>
    <type>
      <types>CatalogRef.CRM_СтатусыРаботыСКлиентом</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Правила</name>
    <attributes>
      <name>Условие</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеПредставлениеДляПользователя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/Catalogs/Партнеры/Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Партнеры</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>НашеПредприятие</name>
      <description>Наше предприятие</description>
    </items>
    <items>
      <name>НеизвестныйПартнер</name>
      <description>Неизвестный партнер</description>
    </items>
    <items>
      <name>РозничныйПокупатель</name>
      <description>Розничный покупатель</description>
    </items>
  </predefined>
  <attributes>
    <name>БизнесРегион</name>
    <comment>Используется для группировки по территориальному признаку</comment>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <comment>Используется при анализе первичного интереса</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <comment>Клиенты</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <comment>Поставщики</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Публичное наименование, например, для печати или устного обращения.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <comment>Конкуренты</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <comment>Прочие отношения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбслуживаетсяТорговымиПредставителями</name>
    <comment>Обслуживаются торговыми представителями</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <comment>Перевозчики</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <type>
      <types>CatalogRef.ШаблоныЭтикетокИЦенников</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.КомпанияЧастноеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПереработчика</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОтправкиЭлектронногоЧека</name>
    <type>
      <types>EnumRef.ВариантыОтправкиЭлектронногоЧекаПокупателю</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаДоставки</name>
    <type>
      <types>CatalogRef.ЗоныДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндивидуальныйВидЦены</name>
    <comment>Уточняющий или индивидуальный вид цены</comment>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Важность</name>
    <comment>Важность клиента</comment>
    <type>
      <types>CatalogRef.CRM_ВажностьКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Имя</name>
    <comment>Имя клиента</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_НапоминатьОДнеРождения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОсновнаяОтрасль</name>
    <type>
      <types>CatalogRef.CRM_Отрасли</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОсновноеКонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОсновнойАдрес</name>
    <type>
      <types>CatalogRef.CRM_АдресаОфисовКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОтписалсяОтEmailРассылок</name>
    <comment>Отписался от рассылок</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Отчество</name>
    <comment>Отчество клиента частное лицо</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Потенциал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СегментРынка</name>
    <comment>Сегмент рынка клиента</comment>
    <type>
      <types>CatalogRef.CRM_СегментыРынка</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СтатусРаботы</name>
    <comment>Статус работы с клиентом</comment>
    <type>
      <types>CatalogRef.CRM_СтатусыРаботыСКлиентом</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ТипОтношенийПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Фамилия</name>
    <comment>Фамилия клиента частное лицо</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ФизЛицо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Фотография</name>
    <comment>Фотография клиента частное лицо</comment>
    <type>
      <types>CatalogRef.ПартнерыПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЧисленностьРабочихМест</name>
    <comment>Численность рабочих мест клиента</comment>
    <type>
      <types>CatalogRef.CRM_ЧисленностьРабочихМестКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЧисленностьСотрудников</name>
    <comment>Численность сотрудников клиента</comment>
    <type>
      <types>CatalogRef.CRM_ЧисленностьСотрудниковКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>сфпCoMagicID</name>
    <comment>Идентификатор контакта в системе CoMagic</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>сфпПользовательДляПереключенияЗвонков</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Госорганы</name>
    <comment>Клиент является государственной организацией</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Учредитель</name>
    <comment>Клиент является учредителем</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>CRM_ОсновнойДляСвязи</name>
      <comment>Основной вид контактной информации для связи</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>сфпВремяЗадержкиНабораДобавочногоНомера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>сфпПрефиксНабора</name>
      <type>
        <types>CatalogRef.сфпПрефиксыИсходящихВызовов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ВидыДеятельности</name>
    <attributes>
      <name>ВидДеятельности</name>
      <type>
        <types>CatalogRef.CRM_Отрасли</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ДополнительнаяИнформация</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_Теги</name>
    <attributes>
      <name>Тег</name>
      <type>
        <types>CatalogRef.CRM_Теги</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ТипыОтношений</name>
    <attributes>
      <name>ТипОтношений</name>
      <type>
        <types>CatalogRef.CRM_ТипыОтношений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/Catalogs/CRM_ПравилаРасчетаКачестваЗаполненияДанных/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьСписокВыбораДоступныхТиповОбъектов();
	ПоместитьНастройкиВоВременноеХранилище();
	ЗаполнитьИменаШаблонов();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Соответствие = ПолучитьИзВременногоХранилища(АдресХранилищаКомпоновщикНастроек);
	ТекущийОбъект.Правила.Очистить();
	
	Для каждого СтрокаНастроки Из Объект.Правила Цикл
		ТекСтрока = ТекущийОбъект.Правила.Добавить();
		ЗаполнитьЗначенияСвойств(ТекСтрока, СтрокаНастроки);
		ТекСтрока.Условие = Новый ХранилищеЗначения(Соответствие.Получить(СтрокаНастроки.ПолучитьИдентификатор()));
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Объект.Ссылка)
		И Не Объект.ЭтоГруппа
		И Не Модифицированность Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ПравилоНеИзменено");		
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти  
	
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтатусРаботыСКлиентомПриИзменении(Элемент)
	ЗаполнитьНаименование(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ТипОбъектаПриИзменении(Элемент)
	ЗаполнитьИменаШаблонов();
	ЗаполнитьНаименование(ЭтотОбъект);	
КонецПроцедуры

&НаКлиенте
Процедура ТипОбъектаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ВыбранноеЗначение = Объект.ТипОбъекта Тогда
		Объект.Правила.Очистить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
	
#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура ПравилаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ПравилаУсловиеПредставление" Тогда
		СтандартнаяОбработка = Ложь;
		ТекСтрока = Элементы.Правила.ТекущиеДанные;
		Если ТекСтрока = Неопределено Тогда
			Возврат;	
		КонецЕсли;
		
		ИмяМакета = ПолучитьИмяМакетаНастроек(Объект.ТипОбъекта);
		Если Не ЗначениеЗаполнено(ИмяМакета) Тогда
			Возврат;	
		КонецЕсли; 
		
		ИДСтроки = ТекСтрока.ПолучитьИдентификатор();
		
		ПараметрыКомпоновки = Новый Структура;
		ПараметрыКомпоновки.Вставить("НастройкиКомпоновкиДанных", ПолучитьНастройкиКомпоновки(ИДСтроки));
		ПараметрыКомпоновки.Вставить("ИмяОбъектаМетаданных", "Справочник.CRM_ПравилаРасчетаКачестваЗаполненияДанных");
		ПараметрыКомпоновки.Вставить("ИмяМакета", ИмяМакета);
				
		ОписаниеОповещения = Новый ОписаниеОповещения("ПриИзмененииНастроекКомпоновкиДанных", ЭтотОбъект, ИДСтроки);
		
		ОткрытьФорму("ОбщаяФорма.CRM_НастройкиКомпоновкиДанных", ПараметрыКомпоновки, ЭтотОбъект,,,, ОписаниеОповещения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьНастройкиКомпоновки(ИДСтроки)
	
	Если ЗначениеЗаполнено(АдресХранилищаКомпоновщикНастроек) Тогда
		СоответствиеНастройкиХранилищеЗначения = ПолучитьИзВременногоХранилища(АдресХранилищаКомпоновщикНастроек);
		Если ТипЗнч(СоответствиеНастройкиХранилищеЗначения) = Тип("Соответствие") Тогда			
			НастройкаКомпоновки = СоответствиеНастройкиХранилищеЗначения.Получить(ИДСтроки);
			Если ТипЗнч(НастройкаКомпоновки) = Тип("НастройкиКомпоновкиДанных") Тогда
				Возврат НастройкаКомпоновки;
			КонецЕсли; 
		КонецЕсли;                                                      	
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

&НаКлиенте
Процедура КомментарийОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
КонецПроцедуры
	
#КонецОбласти


#Область ОбаботчикиКомандФормы

&НаСервере
Процедура ЗаполнитьПоШаблонуНаСервере(КомандаИмя)
	
	ИмяВарианта = СтрЗаменить(КомандаИмя, "Команда_ЗаполнитьПоШаблону_", "");
	
	ИмяМакета = ПолучитьИмяМакетаНастроек(Объект.ТипОбъекта);
	Если Не ЗначениеЗаполнено(ИмяМакета) Тогда
		Возврат;	
	КонецЕсли;

	Объект.Правила.Очистить();
	
	СКД = Справочники.CRM_ПравилаРасчетаКачестваЗаполненияДанных.ПолучитьМакет(ИмяМакета);
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	
	Для Каждого Вариант Из СКД.ВариантыНастроек Цикл
		Если Вариант.Имя = ИмяВарианта Тогда
			Для Каждого ЭлементОтбора Из Вариант.Настройки.Отбор.Элементы Цикл
				КомпоновщикНастроек.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
				ЗаполнитьЭлементОтбораКомпоновщика(КомпоновщикНастроек.Настройки.Отбор.Элементы, ЭлементОтбора);

				Представление = Строка(КомпоновщикНастроек.Настройки.Отбор);
				Вес = 0;
				Если ЗначениеЗаполнено(ЭлементОтбора.Представление) Тогда
					ДанныеПоУсловию = CRM_ОбщегоНазначенияСервер.ЗначениеИзСтрокиJSON(ЭлементОтбора.Представление);
					Если ДанныеПоУсловию.Свойство("Представление") Тогда
						Представление = ДанныеПоУсловию.Представление;
					КонецЕсли;
					Если ДанныеПоУсловию.Свойство("Вес") Тогда
						Вес = ДанныеПоУсловию.Вес;
					КонецЕсли;
				КонецЕсли;
				
				Правило = Объект.Правила.Добавить();
				ИДСтроки = Правило.ПолучитьИдентификатор();
				Правило.УсловиеПредставление = Представление;
				Правило.УсловиеПредставлениеДляПользователя = Представление;
				Правило.Вес = Вес;
				ОбновитьНастройкиКомпоновки(ИДСтроки, КомпоновщикНастроек.Настройки);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьПоШаблону(Команда)
	ЗаполнитьПоШаблонуНаСервере(Команда.Имя);
КонецПроцедуры

#КонецОбласти

	
#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьИмяМакетаНастроек(ТипОбъекта)

	Возврат Справочники.CRM_ПравилаРасчетаКачестваЗаполненияДанных.ПолучитьИмяМакетаНастроек(ТипОбъекта);	

КонецФункции

&НаСервере
Процедура ЗаполнитьСписокВыбораДоступныхТиповОбъектов()
	Элементы.ТипОбъекта.СписокВыбора.Добавить("Справочник.Партнеры", "Клиенты");	 
	Элементы.ТипОбъекта.СписокВыбора.Добавить("Справочник.КонтактныеЛицаПартнеров", "Контактные лица");	 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИменаШаблонов()
	
	УдаляемыеЭлементы = Новый Массив;
	Для Каждого Элемент Из Элементы.ПодменюЗаполнитьПоШаблону.ПодчиненныеЭлементы Цикл
		ИмяКоманды = СтрЗаменить(Элемент.Имя, "Элемент_ЗаполнитьПоШаблону_", "Команда_ЗаполнитьПоШаблону_");
		УдаляемыеЭлементы.Добавить(Элемент.Имя); 
		Команда = Команды.Найти(ИмяКоманды);
		Если Команда <> Неопределено Тогда
			Команды.Удалить(Команда);
		КонецЕсли;
	КонецЦикла;
	Для Каждого Элемент Из УдаляемыеЭлементы Цикл
		Элементы.Удалить(Элементы[Элемент]);
	КонецЦикла;
	
	ИмяМакета = ПолучитьИмяМакетаНастроек(Объект.ТипОбъекта);
	Если Не ЗначениеЗаполнено(ИмяМакета) Тогда
		Возврат;	
	КонецЕсли;
	
	СКД = Справочники.CRM_ПравилаРасчетаКачестваЗаполненияДанных.ПолучитьМакет(ИмяМакета);
	Для Каждого Вариант Из СКД.ВариантыНастроек Цикл
		Если Вариант.Имя = "Основной" Тогда
			Продолжить;
		КонецЕсли;
		
		Команда = Команды.Добавить("Команда_ЗаполнитьПоШаблону_" + Вариант.Имя);
		Команда.Действие = "Подключаемый_ЗаполнитьПоШаблону";
		Команда.Заголовок = Вариант.Представление;
		
		НовыйПунктМеню = Элементы.Добавить("Элемент_ЗаполнитьПоШаблону_" + Вариант.Имя, Тип("КнопкаФормы"),
			Элементы.ПодменюЗаполнитьПоШаблону);
		НовыйПунктМеню.ИмяКоманды = Команда.Имя;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПоместитьНастройкиВоВременноеХранилище()
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	СоответствиеПравила = Новый Соответствие;
	Для каждого Правило Из Объект.Правила Цикл
		СтрокаХранилищеНастройки = ТекущийОбъект.Правила.Получить(Объект.Правила.Индекс(Правило));
		СоответствиеПравила.Вставить(Правило.ПолучитьИдентификатор(), СтрокаХранилищеНастройки.Условие.Получить());	
	КонецЦикла;  
	
	АдресХранилищаКомпоновщикНастроек = ПоместитьВоВременноеХранилище(СоответствиеПравила, УникальныйИдентификатор);	

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииНастроекКомпоновкиДанных(Результат, ИДСтроки) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекСтрока = Объект.Правила.НайтиПоИдентификатору(ИДСтроки);
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекСтрока.УсловиеПредставление = Результат.ПредставлениеОтбора;
	ТекСтрока.УсловиеПредставлениеДляПользователя = Результат.ПредставлениеОтбора;
	ОбновитьНастройкиКомпоновки(ИДСтроки, Результат.Настройки);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНастройкиКомпоновки(ИДСтроки, Настройки)
	
	Соответствие = ПолучитьИзВременногоХранилища(АдресХранилищаКомпоновщикНастроек);
	ТекНастройки = ?(ЗначениеЗаполнено(Настройки.Отбор), Настройки, Неопределено);
	Соответствие.Вставить(ИДСтроки, ТекНастройки);
	
	АдресХранилищаКомпоновщикНастроек = ПоместитьВоВременноеХранилище(Соответствие, УникальныйИдентификатор);
	
КонецПроцедуры


&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьНаименование(Форма)

	ТипОбъекта = Форма.Объект.ТипОбъекта;
	Если ЗначениеЗаполнено(ТипОбъекта) Тогда
		ЗначениеСпискаВыбора = Форма.Элементы.ТипОбъекта.СписокВыбора.НайтиПоЗначению(ТипОбъекта);
		Если Не ЗначениеСпискаВыбора = Неопределено Тогда
			ТипОбъекта = ЗначениеСпискаВыбора.Представление;		
		КонецЕсли;                                          	
	КонецЕсли;
	
	Форма.Объект.Наименование = ПолучитьНаименование(ТипОбъекта, Форма.Объект.СтатусРаботыСКлиентом); 

КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьНаименование(ТипОбъекта, СтатусРаботыСКлиентом)

	МассивНаименование = Новый Массив;
	
	Если ЗначениеЗаполнено(ТипОбъекта) Тогда
		МассивНаименование.Добавить(ТипОбъекта);	
	КонецЕсли; 
	Если ЗначениеЗаполнено(СтатусРаботыСКлиентом) Тогда
		МассивНаименование.Добавить(СтатусРаботыСКлиентом.Наименование);	
	КонецЕсли;
	
	Возврат СтрСоединить(МассивНаименование, " ");
	
КонецФункции 

&НаСервере
Процедура ЗаполнитьЭлементОтбораКомпоновщика(ЭлементыОтбора, Источник)
	Если ТипЗнч(Источник) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
		НовыйЭлемент = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЗаполнитьЗначенияСвойств(НовыйЭлемент, Источник);
		НовыйЭлемент.Представление = "";
	Иначе
		НоваяГруппа = ЭлементыОтбора.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ЗаполнитьЗначенияСвойств(НоваяГруппа, Источник);
		Для Каждого ЭлементОтбора Из Источник.Элементы Цикл
			ЗаполнитьЭлементОтбораКомпоновщика(НоваяГруппа.Элементы, ЭлементОтбора);
		КонецЦикла;
		НоваяГруппа.Представление = "";
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
